# เราจำเป็นต้องรู้ชื่อสัตว์เลี้ยงตัวใหม่ของเรา

# ใช้ฟังก์ชันนี้เป็นตัวจัดการสำหรับอีเวนท์"hear" เกี่ยวกับสัตว์เลี้ยง
def onHear(event):
    # อย่าเปลี่ยนฟังก์ชันนี้
    pet.say("เมี๊ยววว โฮ่งงงง เมี๊ยววว")
    pet.say("โฮ่งงงง โฮ่งงงง")
    pet.say("เมี๊ยววว")
    pet.say("เมี๊ยววว")
    pet.say("เมี๊ยววว โฮ่งงงง เมี๊ยววว เมี๊ยววว")

# ใช้ pet.on(eventType, eventHandler) เมธอด
# กำหนดฟังก์ชัน onHear เพื่อจัดการเหตุการณ์ "hear"
pet.on("hear", onHear)

# มันต้องอยู่หลัง "pet.on"
hero.say("ชื่ออะไร เพื่อน?")
hero.say("ทำซ้ำได้ไหม?")
