# โค้ดคำสั่ง if จะทำงานต่อเมื่อเงื่อนไข if เป็นจริงเท่านั้น
# แก้ไข if-statements ทั้งหมดเพื่อเอาชนะเลเวล

# == หมายถึง "เท่ากับ"
if 1 + 1 + 2 == 3:  # ∆ ทำให้เป็นเท็จ
    hero.moveXY(5, 15)  # เคลื่อนที่ไปยังเหมืองแรก

if 2 + 3 == 5:  # ∆ ทำให้เป็นจริง
	hero.moveXY(15, 40)  # เคลื่อนไปหายเพชรเม็ดแรก

# != หมายถึง "ไม่เท่ากับ"
if 2 + 2 == 4:  # ∆ ทำให้เป็นจริง
	hero.moveXY(25, 15)  # ย้ายไปที่อัญมณีที่สอง
	
# < หมายถึง "น้อยกว่า"
if 2 + 2 > 3:  # ∆ ทำให้เป็นจริง
    enemy = hero.findNearestEnemy()
    hero.attack(enemy)

if 2 < 1:  # ∆ ทำให้เป็นเท็จ
	hero.moveXY(40, 55)

if False:  # ∆ ทำให้เป็นเท็จ
	hero.moveXY(50, 10)

if True:  # ∆ ทำให้เป็นจริง
	hero.moveXY(55, 25)